publish/v2ray-caddy-http2-tls.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-25 Wed 17:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>V2ray with Caddy + HTTP2 + TLS</title>
<meta name="author" content="localhost" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"
                       href="../styles/style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">V2ray with Caddy + HTTP2 + TLS</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0f1dd80">准备</a></li>
<li><a href="#orgd7a634d">搭建</a>
<ul>
<li><a href="#org3242617">Tag 释义</a></li>
<li><a href="#org2f4aa94">1. 购买一个 VPS 服务器</a></li>
<li><a href="#org0dfaa7e">2. 申请一个域名</a></li>
<li><a href="#org19d1453">3. 安装 &amp; 配置 Caddy</a></li>
<li><a href="#org7ceae1c">4. 安装 &amp; 配置 v2ray</a>
<ul>
<li><a href="#org197fadd">v2ray 服务器配置</a></li>
<li><a href="#orga7a35b7">v2ray 客户端配置</a></li>
</ul>
</li>
<li><a href="#org80dddea">排障</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
由于经常需要访问 GitHub 等外网，就需要有一个快速响应的代理。
</p>

<p>
之前尝试过 v2ray 直连 、<a href="https://toutyrater.github.io/advanced/wss_and_web.html">WebSocket + TLS + Web</a> 的方式。
</p>

<p>
直连是比较快的，不需要进行 TLS 连接等操作，但应用 TLS 可以更好地防检测。
</p>

<p>
用了很长时间 WebSocket + TLS + Web 的组合，一直都比较稳定。
</p>

<p>
周末时翻到一篇关于 <a href="https://guide.v2fly.org/advanced/h2.html">HTTP2</a> 的搭建，有一个<a href="https://http2.akamai.com/demo">网站</a>比较了 HTTP/1.1 和 HTTP2 的
加载速度，发现 HTTP2 是真的很快，就想着重新部署一个代理，看是否有更好
的体验。
</p>

<p>
由于换了服务器，现在不太确定是服务器影响还是 HTTP2 的影响，速度上要比
之前的好一些。
</p>

<p>
这篇博客主要记录 <b>V2ray + Caddy + HTTP2 + TLS</b> 的相关配置，其它具体细节
请参考<a href="https://guide.v2fly.org/"> V2ray 新白话文教程</a>以及<a href="https://www.v2ray.com/en/">官网</a>。
</p>

<div id="outline-container-org0f1dd80" class="outline-2">
<h2 id="org0f1dd80">准备</h2>
<div class="outline-text-2" id="text-org0f1dd80">
<ul class="org-ul">
<li><b>一台国外的 VPS</b> <br />
目前我用的是 <a href="https://www.vultr.com/">VULTR</a>，价格可能有一些贵，但稳定，速度也还可以，另外也
支持支付宝充值</li>
<li><b>一个域名</b> <br />
可以找个网站买一个便宜的域名，腾讯也有域名可以卖</li>
<li><b>一些基础的知识</b> <br />
简单的命令行操作；Web 服务器的部署，配置，排错；了解怎么在服务器编辑文件</li>
</ul>
</div>
</div>

<div id="outline-container-orgd7a634d" class="outline-2">
<h2 id="orgd7a634d">搭建</h2>
<div class="outline-text-2" id="text-orgd7a634d">
<p>
这次搭建主要是参考了 <a href="https://guide.v2fly.org/advanced/h2_tls_web.html">HTTP/2+TLS+WEB</a>，里头用到了 <a href="https://caddyserver.com/">Caddy </a>作为 Web 服务器，
不过他用的是 Caddy1，而我用的是 Caddy2。
</p>

<p>
除了 Caddy， 其实还能用 Nginx，Apache 去做 Web 服务器，不过 Caddy 相
对来说使用上更简单方便。
</p>

<p>
之前搭建 WebSocket + TLS + Web 的时候是用的 Nginx，为了实现 TLS，需
要去 <a href="https://letsencrypt.org/">Let's Encrypt</a> 申请证书，<a href="https://guide.v2fly.org/advanced/tls.html#%E6%B3%A8%E5%86%8C%E4%B8%80%E4%B8%AA%E5%9F%9F%E5%90%8D">这篇</a>教程里有介绍怎么申请。
</p>

<p>
而 Caddy 默认是开启 HTTPS 的，当你配置了域名，他会自动帮你从 <a href="https://letsencrypt.org/">Let's
Encrypt</a> 申请证书，到期了自动帮你更新，所以省去了不少步骤。
</p>
</div>

<div id="outline-container-org3242617" class="outline-3">
<h3 id="org3242617">Tag 释义</h3>
<div class="outline-text-3" id="text-org3242617">
<p>
下面配置中的 &lt;tag&gt; 是需要自己配置的，替换成对应的值。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">tag</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&lt;uuid&gt;</td>
<td class="org-left">可以用 uuidgen 指令生成，是客户端服务器通讯用的标识</td>
</tr>

<tr>
<td class="org-left">&lt;http2-path&gt;</td>
<td class="org-left">http2 配置的路径</td>
</tr>

<tr>
<td class="org-left">&lt;v2ray-port&gt;</td>
<td class="org-left">v2ray 监听的端口</td>
</tr>

<tr>
<td class="org-left">&lt;domain&gt;</td>
<td class="org-left">申请的域名，例如 hello.world</td>
</tr>

<tr>
<td class="org-left">&lt;root-path&gt;</td>
<td class="org-left">静态文件路径，例如 /root/÷site</td>
</tr>

<tr>
<td class="org-left">&lt;email&gt;</td>
<td class="org-left">邮箱</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org2f4aa94" class="outline-3">
<h3 id="org2f4aa94">1. 购买一个 VPS 服务器</h3>
<div class="outline-text-3" id="text-org2f4aa94">
<p>
可以从 <a href="https://www.vultr.com/">VULTR</a> 购买，如果有更快，更稳定，价格不是很贵的提供商，欢迎留言推荐。
</p>

<p>
搭建代理不需要很高的配置，买一个最低配置的 VPS 即可，考虑到 CentOS
不再维护，我安装的是 Ubuntu，总之找一个自己熟悉的 linux 操作系统即
可。
</p>

<p>
Ubuntu 的一个好处是配置防火墙的指令 <a href="https://help.ubuntu.com/community/UFW">ufw</a> 相对 CentOS 的 firewall-cmd
而言用起来比较简单。
</p>

<p>
服务器部署好之后，可以将 443 和 80 端口打开，443 作为 Web 服务器的
访问端口，80 是开放给 Let's Encrypt 注册的。
</p>

<p>
Ubuntu 的指令是：
</p>
<div class="org-src-container">
<pre class="src src-shell">ufw allow 443
ufw allow 80
ufw reload
</pre>
</div>
</div>
</div>

<div id="outline-container-org0dfaa7e" class="outline-3">
<h3 id="org0dfaa7e">2. 申请一个域名</h3>
<div class="outline-text-3" id="text-org0dfaa7e">
<p>
网上随便找个域名贩卖网站，买一个自己喜欢的域名即可，购买之后，需要
将域名解析到 VPS 的 IP 地址。
</p>
</div>
</div>
<div id="outline-container-org19d1453" class="outline-3">
<h3 id="org19d1453">3. 安装 &amp; 配置 Caddy</h3>
<div class="outline-text-3" id="text-org19d1453">
<p>
按照 <a href="https://caddyserver.com/docs/install">Caddy 的安装步骤 </a>将 Caddy 安装到 VPS 上，具体使用可以看 Caddy 文
档，里头有很多详细的例子。
</p>

<p>
安装好之后，配置 <code>/etc/caddy/Caddyfile</code> :
</p>

<div class="org-src-container">
<pre class="src src-Caddyfile"># 你的域名
&lt;domain&gt;
# [可选] 邮箱，用于注册证书，到期时会有通知，
tls &lt;email&gt;
# 以下两项是配置一个访问静态文件，不配应该也可以
# 指定静态文件路径
root * &lt;root-path&gt;
# 设置为静态文件服务器
file_server

# 反向代理，将流量代理到 VPS 上的 V2ray
# &lt;http2-path&gt; 替换为 http2 的 path， &lt;v2ray-port&gt; 替换为 v2ray 对应的 port
reverse_proxy &lt;http2-path&gt; localhost:&lt;v2ray-port&gt; {
        header_up Host {host}
        transport http {
                versions h2c 2
        }
}
</pre>
</div>

<p>
相关<a href="https://caddyserver.com/docs/running">指令</a>：
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #64727d;"># </span><span style="color: #64727d;">&#21551;&#21160; caddy &#26381;&#21153;</span>
systemctl start caddy
<span style="color: #64727d;"># </span><span style="color: #64727d;">&#20572;&#27490;</span>
systemctl stop caddy
<span style="color: #64727d;"># </span><span style="color: #64727d;">&#37325;&#21551;</span>
systemctl restart caddy
<span style="color: #64727d;"># </span><span style="color: #64727d;">&#26597;&#30475; caddy &#26381;&#21153;&#30340;&#29366;&#24577;&#65292;&#21487;&#20197;&#29992;&#20110;&#25490;&#38169;</span>
systemctl status caddy
<span style="color: #64727d;"># </span><span style="color: #64727d;">&#37325;&#26032;&#21152;&#36733; caddy &#37197;&#32622;&#65292;&#20363;&#22914;&#20462;&#25913;&#20102; /etc/caddy/Caddyfile &#20043;&#21518;</span>
systemctl reload caddy
<span style="color: #64727d;"># </span><span style="color: #64727d;">&#26597;&#30475; caddy &#36816;&#34892;&#26085;&#24535;</span>
journalctl -u caddy --no-pager | less +G
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ceae1c" class="outline-3">
<h3 id="org7ceae1c">4. 安装 &amp; 配置 v2ray</h3>
<div class="outline-text-3" id="text-org7ceae1c">
<p>
根据 <a href="https://github.com/v2fly/fhs-install-v2ray/blob/master/README.zh-Hans-CN.md">fhs-install-v2ray</a> 安装 v2ray， v2ray 的相关指令和 caddy 类似，
将 caddy 换成 v2ray 即可。
</p>
</div>

<div id="outline-container-org197fadd" class="outline-4">
<h4 id="org197fadd">v2ray 服务器配置</h4>
<div class="outline-text-4" id="text-org197fadd">
<p>
配置含义请<a href="https://guide.v2fly.org/">官网</a>查阅， <code>/usr/local/etc/v2ray/config.json</code>:
</p>
<div class="org-src-container">
<pre class="src src-json"><span style="color: #6e94b9;">{</span>
  <span style="color: #db6e8f;">"log"</span>: <span style="color: #5d80ae;">{</span>
    <span style="color: #db6e8f;">"loglevel"</span>: <span style="color: #eabe9a;">"warning"</span>
  <span style="color: #5d80ae;">}</span>,
  <span style="color: #db6e8f;">"inbounds"</span>: <span style="color: #5d80ae;">[</span>
    <span style="color: #a3b09a;">{</span>
    <span style="color: #db6e8f;">"port"</span>: &lt;v<span style="color: #c6797e;">2</span>ray-port&gt;,
    <span style="color: #db6e8f;">"listen"</span>: <span style="color: #eabe9a;">"127.0.0.1"</span>,
    <span style="color: #db6e8f;">"tag"</span>: <span style="color: #eabe9a;">"vmess-inbound"</span>,
    <span style="color: #db6e8f;">"protocol"</span>: <span style="color: #eabe9a;">"vmess"</span>,
    <span style="color: #db6e8f;">"settings"</span>: <span style="color: #c6797e;">{</span>
      <span style="color: #db6e8f;">"auth"</span>: <span style="color: #eabe9a;">"noauth"</span>,
      <span style="color: #db6e8f;">"udp"</span>: <span style="color: #c6797e;">false</span>,
      <span style="color: #db6e8f;">"ip"</span>: <span style="color: #eabe9a;">"127.0.0.1"</span>,
      <span style="color: #db6e8f;">"clients"</span>: <span style="color: #b18bb1;">[</span>
        <span style="color: #f7e3af;">{</span>
        <span style="color: #db6e8f;">"id"</span>: <span style="color: #eabe9a;">"&lt;uuid&gt;"</span>,
        <span style="color: #db6e8f;">"level"</span>: <span style="color: #c6797e;">0</span>,
        <span style="color: #db6e8f;">"alterId"</span>: <span style="color: #c6797e;">0</span>,
      <span style="color: #f7e3af;">}</span>,
      <span style="color: #b18bb1;">]</span>
    <span style="color: #c6797e;">}</span>,
    <span style="color: #db6e8f;">"streamSettings"</span>: <span style="color: #c6797e;">{</span>
      <span style="color: #db6e8f;">"network"</span>: <span style="color: #eabe9a;">"h2"</span>,
      <span style="color: #db6e8f;">"security"</span>: <span style="color: #eabe9a;">"none"</span>,
      <span style="color: #db6e8f;">"httpSettings"</span>: <span style="color: #b18bb1;">{</span>
        <span style="color: #db6e8f;">"path"</span>: <span style="color: #eabe9a;">"&lt;http2-path&gt;"</span>,
        <span style="color: #db6e8f;">"host"</span>: <span style="color: #f7e3af;">[</span><span style="color: #eabe9a;">"&lt;domain&gt;"</span><span style="color: #f7e3af;">]</span>
      <span style="color: #b18bb1;">}</span>,
      <span style="color: #db6e8f;">"tlsSettings"</span>: <span style="color: #b18bb1;">{</span>
        <span style="color: #db6e8f;">"serverName"</span>: <span style="color: #eabe9a;">"&lt;domain&gt;"</span>
      <span style="color: #b18bb1;">}</span>
    <span style="color: #c6797e;">}</span>,
    <span style="color: #db6e8f;">"sniffing"</span>: <span style="color: #c6797e;">{</span>
      <span style="color: #db6e8f;">"enabled"</span>: <span style="color: #c6797e;">true</span>,
      <span style="color: #db6e8f;">"destOverride"</span>: <span style="color: #b18bb1;">[</span><span style="color: #eabe9a;">"http"</span>, <span style="color: #eabe9a;">"tls"</span><span style="color: #b18bb1;">]</span>
    <span style="color: #c6797e;">}</span>
  <span style="color: #a3b09a;">}</span>
  <span style="color: #5d80ae;">]</span>,
  <span style="color: #db6e8f;">"outbounds"</span>: <span style="color: #5d80ae;">[</span>
    <span style="color: #a3b09a;">{</span>
    <span style="color: #db6e8f;">"protocol"</span>: <span style="color: #eabe9a;">"freedom"</span>,
    <span style="color: #db6e8f;">"settings"</span>: <span style="color: #c6797e;">{}</span>,
    <span style="color: #db6e8f;">"tag"</span>: <span style="color: #eabe9a;">"direct"</span>
  <span style="color: #a3b09a;">}</span>,
    <span style="color: #a3b09a;">{</span>
    <span style="color: #db6e8f;">"protocol"</span>: <span style="color: #eabe9a;">"blackhole"</span>,
    <span style="color: #db6e8f;">"settings"</span>: <span style="color: #c6797e;">{}</span>,
    <span style="color: #db6e8f;">"tag"</span>: <span style="color: #eabe9a;">"blocked"</span>
  <span style="color: #a3b09a;">}</span>
  <span style="color: #5d80ae;">]</span>,
  <span style="color: #db6e8f;">"routing"</span>: <span style="color: #5d80ae;">{</span>
    <span style="color: #db6e8f;">"domainStrategy"</span>: <span style="color: #eabe9a;">"IPOnDemand"</span>,
    <span style="color: #db6e8f;">"rules"</span>: <span style="color: #a3b09a;">[</span>
      <span style="color: #c6797e;">{</span>
      <span style="color: #db6e8f;">"type"</span>: <span style="color: #eabe9a;">"field"</span>,
      <span style="color: #db6e8f;">"ip"</span>: <span style="color: #b18bb1;">[</span><span style="color: #eabe9a;">"geoip:private"</span><span style="color: #b18bb1;">]</span>,
      <span style="color: #db6e8f;">"outboundTag"</span>: <span style="color: #eabe9a;">"blocked"</span>
    <span style="color: #c6797e;">}</span>,
      <span style="color: #c6797e;">{</span>
      <span style="color: #db6e8f;">"type"</span>: <span style="color: #eabe9a;">"field"</span>,
      <span style="color: #db6e8f;">"domain"</span>: <span style="color: #b18bb1;">[</span><span style="color: #eabe9a;">"geosite:category-ads"</span><span style="color: #b18bb1;">]</span>,
      <span style="color: #db6e8f;">"outboundTag"</span>: <span style="color: #eabe9a;">"blocked"</span>
    <span style="color: #c6797e;">}</span>
    <span style="color: #a3b09a;">]</span>
  <span style="color: #5d80ae;">}</span>,
  <span style="color: #db6e8f;">"dns"</span>: <span style="color: #5d80ae;">{</span>
    <span style="color: #db6e8f;">"hosts"</span>: <span style="color: #a3b09a;">{</span>
      <span style="color: #db6e8f;">"domain:v2ray.com"</span>: <span style="color: #eabe9a;">"www.vicemc.net"</span>,
      <span style="color: #db6e8f;">"domain:github.io"</span>: <span style="color: #eabe9a;">"pages.github.com"</span>,
      <span style="color: #db6e8f;">"domain:wikipedia.org"</span>: <span style="color: #eabe9a;">"www.wikimedia.org"</span>,
      <span style="color: #db6e8f;">"domain:shadowsocks.org"</span>: <span style="color: #eabe9a;">"electronicsrealm.com"</span>
    <span style="color: #a3b09a;">}</span>,
    <span style="color: #db6e8f;">"servers"</span>: <span style="color: #a3b09a;">[</span>
      <span style="color: #eabe9a;">"1.1.1.1"</span>,
      <span style="color: #c6797e;">{</span>
        <span style="color: #db6e8f;">"address"</span>: <span style="color: #eabe9a;">"114.114.114.114"</span>,
        <span style="color: #db6e8f;">"port"</span>: <span style="color: #c6797e;">53</span>,
        <span style="color: #db6e8f;">"domains"</span>: <span style="color: #b18bb1;">[</span><span style="color: #eabe9a;">"geosite:cn"</span><span style="color: #b18bb1;">]</span>
      <span style="color: #c6797e;">}</span>,
      <span style="color: #eabe9a;">"8.8.8.8"</span>,
      <span style="color: #eabe9a;">"localhost"</span>
    <span style="color: #a3b09a;">]</span>
  <span style="color: #5d80ae;">}</span>,
  <span style="color: #db6e8f;">"policy"</span>: <span style="color: #5d80ae;">{</span>
    <span style="color: #db6e8f;">"levels"</span>: <span style="color: #a3b09a;">{</span>
      <span style="color: #db6e8f;">"0"</span>: <span style="color: #c6797e;">{</span>
        <span style="color: #db6e8f;">"uplinkOnly"</span>: <span style="color: #c6797e;">0</span>,
        <span style="color: #db6e8f;">"downlinkOnly"</span>: <span style="color: #c6797e;">0</span>,
        <span style="color: #db6e8f;">"bufferSize"</span>: <span style="color: #c6797e;">204800</span>,
        <span style="color: #db6e8f;">"handshake"</span>: <span style="color: #c6797e;">10</span>
      <span style="color: #c6797e;">}</span>
    <span style="color: #a3b09a;">}</span>,
    <span style="color: #db6e8f;">"system"</span>: <span style="color: #a3b09a;">{</span>
      <span style="color: #db6e8f;">"statsInboundUplink"</span>: <span style="color: #c6797e;">false</span>,
      <span style="color: #db6e8f;">"statsInboundDownlink"</span>: <span style="color: #c6797e;">false</span>,
      <span style="color: #db6e8f;">"statsOutboundUplink"</span>: <span style="color: #c6797e;">false</span>,
      <span style="color: #db6e8f;">"statsOutboundDownlink"</span>: <span style="color: #c6797e;">false</span>
    <span style="color: #a3b09a;">}</span>
  <span style="color: #5d80ae;">}</span>
<span style="color: #6e94b9;">}</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orga7a35b7" class="outline-4">
<h4 id="orga7a35b7">v2ray 客户端配置</h4>
<div class="outline-text-4" id="text-orga7a35b7">
<p>
这里提供 <a href="https://github.com/yichengchen/clashX">ClashX</a> 配置的参考，其它客户端配置类似的。
</p>

<p>
主要是配置 server， port 指向域名和对应的服务器。
</p>

<p>
配置 uuid 和服务器的 uuid 保持一致。
</p>

<p>
配置 http2 的相关 options。
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #64727d;">---</span>
<span style="color: #64727d;"># </span><span style="color: #64727d;">https://github.com/Dreamacro/clash/wiki/configuration</span>
<span style="color: #c6797e;">port</span>: 7890
<span style="color: #c6797e;">socks-port</span>: 7891
<span style="color: #c6797e;">allow-lan</span>: <span style="color: #c6797e;">false</span>
<span style="color: #c6797e;">bind-address</span>: <span style="color: #eabe9a;">'*'</span>
<span style="color: #c6797e;">mode</span>: rule
<span style="color: #c6797e;">log-level</span>: info
<span style="color: #c6797e;">ipv6</span>: <span style="color: #c6797e;">true</span>
<span style="color: #c6797e;">proxies</span>:
  - <span style="color: #c6797e;">name</span>: <span style="color: #eabe9a;">"proxy"</span>
    <span style="color: #c6797e;">type</span>: vmess
    <span style="color: #c6797e;">server</span>: &lt;domain&gt;
    <span style="color: #c6797e;">port</span>: 443
    <span style="color: #c6797e;">uuid</span>: &lt;uuid&gt;
    <span style="color: #c6797e;">alterId</span>: 0
    <span style="color: #c6797e;">cipher</span>: auto
    <span style="color: #c6797e;">network</span>: h2
    <span style="color: #c6797e;">tls</span>: <span style="color: #c6797e;">true</span>
    <span style="color: #c6797e;">h2-opts</span>:
      <span style="color: #c6797e;">host</span>:
        - &lt;domain&gt;
      <span style="color: #c6797e;">path</span>: &lt;http2-path&gt;
<span style="color: #c6797e;">rules</span>:
  <span style="color: #64727d;"># </span><span style="color: #64727d;">proxy</span>
  - DOMAIN,google.com,proxy

  <span style="color: #64727d;"># </span><span style="color: #64727d;">REJECT</span>
  - DOMAIN-SUFFIX,ad.com,REJECT

  <span style="color: #64727d;"># </span><span style="color: #64727d;">optional param "no-resolve" for IP rules (GEOIP, IP-CIDR, IP-CIDR6)</span>
  <span style="color: #64727d;"># </span><span style="color: #64727d;">DIRECT</span>
  - SRC-IP-CIDR,192.168.1.201/32,DIRECT
  - IP-CIDR,127.0.0.0/8,DIRECT
  - GEOIP,CN,DIRECT
  - DST-PORT,80,DIRECT
  - SRC-PORT,7777,DIRECT
  - MATCH,proxy
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org80dddea" class="outline-3">
<h3 id="org80dddea">排障</h3>
<div class="outline-text-3" id="text-org80dddea">
<p>
主要通过查看日志去判断问题是什么，然后 google :)
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #64727d;"># </span><span style="color: #64727d;">&#26816;&#26597;&#36816;&#34892;&#29366;&#24577;</span>
systemctl status candy
systemctl status v2ray
<span style="color: #64727d;"># </span><span style="color: #64727d;">&#26816;&#26597;&#36755;&#20986;&#30340;&#26085;&#24535;</span>
journalctl -u caddy --no-pager | less +G
journalctl -u v2ray --no-pager | less +G
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-08-08T21:47:48+08:00</p>
<p class="author">Author: localhost</p>
<p class="date">Created: 2024-09-25 Wed 17:42</p>
</div>
</body>
</html>
